tests/load/http-messages.yml
config:
  target: "http://localhost:3001"
  phases:
    # Warm-up phase
    - duration: 30
      arrivalRate: 100
      name: "Warm-up"
    # Ramp-up to 1000 TPS
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      name: "Ramp-up"
    # Sustained load at 1000 TPS
    - duration: 120
      arrivalRate: 1000
      name: "Sustained load - 1000 TPS"
    # Cool-down
    - duration: 30
      arrivalRate: 100
      name: "Cool-down"
  processor: "./load-test-helpers.js"
  variables:
    conversationId: "test-conversation-id"
  plugins:
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Send messages"
    weight: 100
    flow:
      - function: "generateAuth"
      - post:
          url: "/api/messages"
          headers:
            Authorization: "Bearer {{ authToken }}"
            Idempotency-Key: "{{ $randomString() }}"
            Content-Type: "application/json"
          json:
            conversationId: "{{ conversationId }}"
            body: "Load test message {{ $randomString() }}"
          capture:
            - json: "$.data.id"
              as: "messageId"
          expect:
            - statusCode: 200